# <center>Meurtre à SQL City </center>

<div style="text-align: center;">
    <img src="../images/sqlcity.png" width="500" height="200">
</div>

Un meurtre a eu lieu à SQL City ! SQL Murder Mystery est conçu pour être à la fois une leçon autodirigée pour apprendre les concepts et les commandes SQL et un jeu amusant pour les utilisateurs SQL expérimentés pour résoudre un crime intriguant.

Un crime a eu lieu et le détective a besoin de votre aide. Le détective vous a remis le rapport de scène de crime, mais vous l'avez perdu. Vous vous souvenez vaguement que le crime était un ​meurtre​ qui a eu lieu le ​15 janvier 2018​ et qu'il a eu lieu à ​SQL City​. Commencez par récupérer le rapport de scène de crime correspondant dans la base de données du service de police.

https://www.kaggle.com/datasets/johnp47/sql-murder-mystery-database/data

In [128]:
import csv, sqlite3, pandas

con = sqlite3.connect("data/sql-murder-mystery.db")
cur = con.cursor()

In [129]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [130]:
%sql sqlite:///data/sql-murder-mystery.db

In [131]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///data/sql-murder-mystery.db
Done.

[('crime_scene_report',),
 ('drivers_license',),
 ('person',),
 ('facebook_event_checkin',),
 ('interview',),
 ('get_fit_now_member',),
 ('get_fit_now_check_in',),
 ('income',),
 ('solution',)]

In [132]:
%%sql
PRAGMA table_info(crime_scene_report);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'date', 'INTEGER', 0, None, 0),
 (1, 'type', 'TEXT', 0, None, 0),
 (2, 'description', 'TEXT', 0, None, 0),
 (3, 'city', 'TEXT', 0, None, 0)]

In [133]:
%%sql 
SELECT * FROM crime_scene_report  WHERE date == 20180115 AND city == "SQL City" ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(20180115, 'assault', 'Hamilton: Lee, do you yield? Burr: You shot him in the side! Yes he yields!', 'SQL City'),
 (20180115, 'assault', 'Report Not Found', 'SQL City'),
 (20180115, 'murder', 'Security footage shows that there were 2 witnesses. The first witness lives at the last house on "Northwestern Dr". The second witness, named Annabel, lives somewhere on "Franklin Ave".', 'SQL City')]

In [134]:
%%sql
PRAGMA table_info(person);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'license_id', 'INTEGER', 0, None, 0),
 (3, 'address_number', 'INTEGER', 0, None, 0),
 (4, 'address_street_name', 'TEXT', 0, None, 0),
 (5, 'ssn', 'INTEGER', 0, None, 0)]

In [135]:
%%sql 
SELECT * FROM person 
WHERE (address_street_name=="Northwestern Dr" AND address_number = (SELECT MAX(address_number) FROM person)) OR (address_street_name=="Franklin Ave" AND name LIKE "Annabel %") ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(14887, 'Morty Schapiro', 118009, 4919, 'Northwestern Dr', 111564949),
 (16371, 'Annabel Miller', 490173, 103, 'Franklin Ave', 318771143)]

In [136]:
# On sait donc qu'Annabel a pour nom "Miller" et que le témoin de Norwhest house vit dans la dernière maison

In [137]:
%%sql
PRAGMA table_info(interview);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'person_id', 'INTEGER', 0, None, 0),
 (1, 'transcript', 'TEXT', 0, None, 0)]

In [138]:
%%sql 
SELECT * FROM interview
WHERE person_id == 14887 OR person_id==16371;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(14887, 'I heard a gunshot and then saw a man run out. He had a "Get Fit Now Gym" bag. The membership number on the bag started with "48Z". Only gold members have those bags. The man got into a car with a plate that included "H42W".'),
 (16371, 'I saw the murder happen, and I recognized the killer from my gym when I was working out last week on January the 9th.')]

Nos témoins nous enseignent qu'un homme portait un sac "get fit now gym bag" avec les initiales 48Z qui est le sac typique des abonnés gold. Il est parti dans une voiture dont l'imatriculation comportait la séquence H42W.

Le criminel a été vu et le 9 janvier il était bien à la salle.

In [139]:
%%sql
PRAGMA table_info(get_fit_now_member);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'id', 'TEXT', 0, None, 1),
 (1, 'person_id', 'INTEGER', 0, None, 0),
 (2, 'name', 'TEXT', 0, None, 0),
 (3, 'membership_start_date', 'INTEGER', 0, None, 0),
 (4, 'membership_status', 'TEXT', 0, None, 0)]

In [140]:
%%sql 
SELECT * FROM get_fit_now_member 
WHERE id LIKE "48Z%" and membership_status =="gold";

 * sqlite:///data/sql-murder-mystery.db
Done.

[('48Z7A', 28819, 'Joe Germuska', 20160305, 'gold'),
 ('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold')]

In [153]:
%%sql 
SELECT * FROM get_fit_now_member 
WHERE id LIKE "48Z%" ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[('48Z38', 49550, 'Tomas Baisley', 20170203, 'silver'),
 ('48Z7A', 28819, 'Joe Germuska', 20160305, 'gold'),
 ('48Z55', 67318, 'Jeremy Bowers', 20160101, 'gold')]

S'informer sur les témoins

In [152]:
%%sql 
SELECT * FROM get_fit_now_member 
WHERE person_id == 14887 or person_id == 16371

 * sqlite:///data/sql-murder-mystery.db
Done.

[('90081', 16371, 'Annabel Miller', 20160208, 'gold')]

Comment ça se fait qu'on retrouve pas 14887 ? Ce témoin est bien renseigné sur la salle de sport et n'est pourtant pas membre...

In [24]:
%%sql
PRAGMA table_info(get_fit_now_check_in);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'membership_id', 'TEXT', 0, None, 0),
 (1, 'check_in_date', 'INTEGER', 0, None, 0),
 (2, 'check_in_time', 'INTEGER', 0, None, 0),
 (3, 'check_out_time', 'INTEGER', 0, None, 0)]

In [47]:
%%sql 
SELECT * FROM get_fit_now_check_in
WHERE check_in_date = 20180109 AND membership_id == "48Z7A" OR membership_id == "48Z55"	 ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[('48Z7A', 20180109, 1600, 1730), ('48Z55', 20180109, 1530, 1700)]

In [154]:
%%sql 
SELECT * FROM get_fit_now_check_in
WHERE check_in_date = 20180109 ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[('X0643', 20180109, 957, 1164),
 ('UK1F2', 20180109, 344, 518),
 ('XTE42', 20180109, 486, 1124),
 ('1AE2H', 20180109, 461, 944),
 ('6LSTG', 20180109, 399, 515),
 ('7MWHJ', 20180109, 273, 885),
 ('GE5Q8', 20180109, 367, 959),
 ('48Z7A', 20180109, 1600, 1730),
 ('48Z55', 20180109, 1530, 1700),
 ('90081', 20180109, 1600, 1700)]

In [155]:
%%sql 
SELECT * FROM get_fit_now_member 
WHERE id == 90081

 * sqlite:///data/sql-murder-mystery.db
Done.

[('90081', 16371, 'Annabel Miller', 20160208, 'gold')]

Il s'agit à priori de Joe Germuska ou de Jeremy Bowers. A ce stade impossible de savoir qui est le pincipal suspect. Il faut donc utiliser la deuxième information sur la plaque d'immatriculation et le fait qu'il s'agisse de deux hommes

In [41]:
%%sql
PRAGMA table_info(drivers_license);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'age', 'INTEGER', 0, None, 0),
 (2, 'height', 'INTEGER', 0, None, 0),
 (3, 'eye_color', 'TEXT', 0, None, 0),
 (4, 'hair_color', 'TEXT', 0, None, 0),
 (5, 'gender', 'TEXT', 0, None, 0),
 (6, 'plate_number', 'TEXT', 0, None, 0),
 (7, 'car_make', 'TEXT', 0, None, 0),
 (8, 'car_model', 'TEXT', 0, None, 0)]

In [49]:
%%sql 
SELECT * FROM drivers_license
WHERE plate_number LIKE "%H42W%" and gender =="male";

 * sqlite:///data/sql-murder-mystery.db
Done.

[(423327, 30, 70, 'brown', 'brown', 'male', '0H42W2', 'Chevrolet', 'Spark LS'),
 (664760, 21, 71, 'black', 'black', 'male', '4H42WR', 'Nissan', 'Altima')]

Là encore on bloque ! On a deux suspects et à SQL City la politique est claire, on interpelle pas quelqu'un sans des preuves solides ! Uilisons donc la base de données sur les habitants de la ville

In [86]:
%%sql
PRAGMA table_info(person);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'name', 'TEXT', 0, None, 0),
 (2, 'license_id', 'INTEGER', 0, None, 0),
 (3, 'address_number', 'INTEGER', 0, None, 0),
 (4, 'address_street_name', 'TEXT', 0, None, 0),
 (5, 'ssn', 'INTEGER', 0, None, 0)]

In [150]:
%%sql 
SELECT * FROM person
WHERE name =="Joe Germuska" or name=="Jeremy Bowers" or name=="Morty Schapiro" or name=="Annabel Miller" or license_id == 423327 or license_id == 664760 ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(14887, 'Morty Schapiro', 118009, 4919, 'Northwestern Dr', 111564949),
 (16371, 'Annabel Miller', 490173, 103, 'Franklin Ave', 318771143),
 (28819, 'Joe Germuska', 173289, 111, 'Fisk Rd', 138909730),
 (51739, 'Tushar Chandra', 664760, 312, 'Phi St', 137882671),
 (67318, 'Jeremy Bowers', 423327, 530, 'Washington Pl, Apt 3A', 871539279)]

Surprise un nouveau suspect ! A priori Joe Germuska n'a pas de voiture immatriculé avec la séquence "H42W". On va donc le mettre de côté. Mais là ducoup on vient littéralement d'échanger un suspect par un autre. On n'est pas plus avancé... Les deux suspects sont donc Tushar Chandra ou Jeremy Bowers! On peut essayer d'en apprendre plus sur ces deux suspects vis à vis du ssn via la base de données sur les income de nos individus.

In [97]:
%%sql 
SELECT * FROM get_fit_now_member 
WHERE name == "Tushar Chandra";

 * sqlite:///data/sql-murder-mystery.db
Done.

[]

In [101]:
%%sql 
SELECT * FROM get_fit_now_member 
WHERE name == "%Chand%";

 * sqlite:///data/sql-murder-mystery.db
Done.

[]

On voit cependant que Tushar ne semble pas être un membre de la salle de sport. Ce qui nous limite à Jeremy Bowers ! On va donc tenter d'analyser ses posts facebook avec son person_id : 67318.
On va quand même voir ce que nos deux autres suspects ont bien pu poster sur facebook : 
person_id de Joe Gemurska : 28819	

On va également regarder l'activité de nos témoins : 14887 et 16371

In [124]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE person_id == 67318 or person_id == 28819 or person_id == 14887 or person_id == 16371 ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(14887, 4719, 'The Funky Grooves Tour', 20180115),
 (16371, 4719, 'The Funky Grooves Tour', 20180115),
 (67318, 4719, 'The Funky Grooves Tour', 20180115),
 (67318, 1143, 'SQL Symphony Concert', 20171206)]

In [126]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE  date == 20180115;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(56269, 1753, '"I just need enough to tide me over until I need more."\n', 20180115),
 (12272, 2831, "Kinkler's Second Law:\n", 20180115),
 (94218, 1200, "If a listener nods his head when you're explaining your program, wake\n", 20180115),
 (73091, 104, '        "Diet."\n', 20180115),
 (20227, 2513, 'It seems like the less a statesman amounts to, the more he loves the\n', 20180115),
 (29596, 6072, '                -- Mark Twain\n', 20180115),
 (43451, 5155, 'eat.\n', 20180115),
 (71108, 1056, 'effort to teach them good manners.\n', 20180115),
 (39959, 2513, 'Democracy is a form of government that substitutes election by the\n', 20180115),
 (38423, 8548, 'pedestrians.\n', 20180115),
 (60433, 3204, '        handle.\n', 20180115),
 (78037, 9133, 'doing.\n', 20180115),
 (11376, 9288, 'make the rubble bounce"\n', 20180115),
 (23573, 8777, 'There once was a girl named Irene\n', 20180115),
 (23523, 3053, 'A: Three.  One to screw in the lightbulb and two to fend off all those\n', 20180115),
 (72518, 2210, "It's not that I'm afraid to die.  I just don't want to be there when it\n", 20180115),
 (88458, 4290, 'First Rule of History:\n', 20180115),
 (82809, 3999, 'said, "Life is like a bowl of sour cream."\n', 20180115),
 (91104, 9335, 'Children are natural mimic who act like their parents despite every\n', 20180115),
 (49525, 6377, 'it.\n', 20180115),
 (85823, 8012, '                -- Bruce Leverett\n', 20180115),
 (83030, 3209, "Real Programmers don't play tennis, or any other sport that requires you to\n", 20180115),
 (28435, 8193, 'Why did the Roman Empire collapse?  What is the Latin for office\n', 20180115),
 (23264, 2731, 'That made it, paired by dot;\n', 20180115),
 (35366, 4387, 'analyzed, and replaced with new weaknesses.\n', 20180115),
 (32037, 6084, '        The mouse dissolved\n', 20180115),
 (85846, 8360, '                -- Mickey Mouse\n', 20180115),
 (34256, 3016, 'SPELL quiche.  They eat Twinkies, and Szechwan food.\n', 20180115),
 (29554, 3952, '        stupidity.\n', 20180115),
 (89704, 9956, "a cynic's eyes to improve his vision.\n", 20180115),
 (77714, 8657, 'Whenever the literary German dives into a sentence, that is the last\n', 20180115),
 (40276, 7364, 'hour!"\n', 20180115),
 (58603, 9624, '        live.\n', 20180115),
 (11971, 737, "                -- John Barrymore's dying words\n", 20180115),
 (74795, 1878, 'You worry too much about your job.  Stop it.  You are not paid enough\n', 20180115),
 (57237, 8650, "usable, and it works, and if it breaks they'll quickly tell you how to\n", 20180115),
 (72961, 2918, 'Keep America beautiful.  Swallow your beer cans.\n', 20180115),
 (72961, 7822, 'it.\n', 20180115),
 (46815, 3378, 'computer science languages.  Strong typing is for people with weak memories. \n', 20180115),
 (50174, 6517, 'revitalize the corner saloon.\n', 20180115),
 (90890, 1600, '                -- Don Quinn\n', 20180115),
 (62131, 7349, '        "Diet."\n', 20180115),
 (53716, 7684, 'immune to bullets"\n', 20180115),
 (31705, 7297, "Don't cook tonight -- starve a rat today!\n", 20180115),
 (14887, 4719, 'The Funky Grooves Tour', 20180115),
 (16371, 4719, 'The Funky Grooves Tour', 20180115),
 (67318, 4719, 'The Funky Grooves Tour', 20180115)]

In [112]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE event_name LIKE"%SQL Symphony Concert%" and date ==20171206;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(69325, 1143, 'SQL Symphony Concert', 20171206),
 (99716, 1143, 'SQL Symphony Concert', 20171206),
 (67318, 1143, 'SQL Symphony Concert', 20171206)]

In [123]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE person_id == 67318 or person_id == 28819;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(67318, 4719, 'The Funky Grooves Tour', 20180115),
 (67318, 1143, 'SQL Symphony Concert', 20171206)]

In [87]:
%%sql
PRAGMA table_info(income);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'ssn', 'INTEGER', 0, None, 1),
 (1, 'annual_income', 'INTEGER', 0, None, 0)]

In [91]:
%%sql 
SELECT * FROM income
WHERE ssn ==137882671 or ssn==871539279;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(871539279, 10500)]

Pourquoi on ne retrouve que Jeremy Bowers ?

In [92]:
%%sql
PRAGMA table_info(facebook_event_checkin);

 * sqlite:///data/sql-murder-mystery.db
Done.

[(0, 'person_id', 'INTEGER', 0, None, 0),
 (1, 'event_id', 'INTEGER', 0, None, 0),
 (2, 'event_name', 'TEXT', 0, None, 0),
 (3, 'date', 'INTEGER', 0, None, 0)]

In [62]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE date == 20180109 and event_name LIKE "%gold%" or event_name LIKE "%Gym%" or event_name LIKE "%murder%";

 * sqlite:///data/sql-murder-mystery.db
Done.

[(94828, 8417, '        The one who has the gold makes the rules.\n', 20180109)]

In [148]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE date == 20180109 and (event_name LIKE "%gold%" or event_name LIKE "%Gym%" or event_name LIKE "%murder%" or event_name LIKE "%income%") ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(94828, 8417, '        The one who has the gold makes the rules.\n', 20180109)]

In [147]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE date == 20180115  ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(56269, 1753, '"I just need enough to tide me over until I need more."\n', 20180115),
 (12272, 2831, "Kinkler's Second Law:\n", 20180115),
 (94218, 1200, "If a listener nods his head when you're explaining your program, wake\n", 20180115),
 (73091, 104, '        "Diet."\n', 20180115),
 (20227, 2513, 'It seems like the less a statesman amounts to, the more he loves the\n', 20180115),
 (29596, 6072, '                -- Mark Twain\n', 20180115),
 (43451, 5155, 'eat.\n', 20180115),
 (71108, 1056, 'effort to teach them good manners.\n', 20180115),
 (39959, 2513, 'Democracy is a form of government that substitutes election by the\n', 20180115),
 (38423, 8548, 'pedestrians.\n', 20180115),
 (60433, 3204, '        handle.\n', 20180115),
 (78037, 9133, 'doing.\n', 20180115),
 (11376, 9288, 'make the rubble bounce"\n', 20180115),
 (23573, 8777, 'There once was a girl named Irene\n', 20180115),
 (23523, 3053, 'A: Three.  One to screw in the lightbulb and two to fend off all those\n', 20180115),
 (72518, 2210, "It's not that I'm afraid to die.  I just don't want to be there when it\n", 20180115),
 (88458, 4290, 'First Rule of History:\n', 20180115),
 (82809, 3999, 'said, "Life is like a bowl of sour cream."\n', 20180115),
 (91104, 9335, 'Children are natural mimic who act like their parents despite every\n', 20180115),
 (49525, 6377, 'it.\n', 20180115),
 (85823, 8012, '                -- Bruce Leverett\n', 20180115),
 (83030, 3209, "Real Programmers don't play tennis, or any other sport that requires you to\n", 20180115),
 (28435, 8193, 'Why did the Roman Empire collapse?  What is the Latin for office\n', 20180115),
 (23264, 2731, 'That made it, paired by dot;\n', 20180115),
 (35366, 4387, 'analyzed, and replaced with new weaknesses.\n', 20180115),
 (32037, 6084, '        The mouse dissolved\n', 20180115),
 (85846, 8360, '                -- Mickey Mouse\n', 20180115),
 (34256, 3016, 'SPELL quiche.  They eat Twinkies, and Szechwan food.\n', 20180115),
 (29554, 3952, '        stupidity.\n', 20180115),
 (89704, 9956, "a cynic's eyes to improve his vision.\n", 20180115),
 (77714, 8657, 'Whenever the literary German dives into a sentence, that is the last\n', 20180115),
 (40276, 7364, 'hour!"\n', 20180115),
 (58603, 9624, '        live.\n', 20180115),
 (11971, 737, "                -- John Barrymore's dying words\n", 20180115),
 (74795, 1878, 'You worry too much about your job.  Stop it.  You are not paid enough\n', 20180115),
 (57237, 8650, "usable, and it works, and if it breaks they'll quickly tell you how to\n", 20180115),
 (72961, 2918, 'Keep America beautiful.  Swallow your beer cans.\n', 20180115),
 (72961, 7822, 'it.\n', 20180115),
 (46815, 3378, 'computer science languages.  Strong typing is for people with weak memories. \n', 20180115),
 (50174, 6517, 'revitalize the corner saloon.\n', 20180115),
 (90890, 1600, '                -- Don Quinn\n', 20180115),
 (62131, 7349, '        "Diet."\n', 20180115),
 (53716, 7684, 'immune to bullets"\n', 20180115),
 (31705, 7297, "Don't cook tonight -- starve a rat today!\n", 20180115),
 (14887, 4719, 'The Funky Grooves Tour', 20180115),
 (16371, 4719, 'The Funky Grooves Tour', 20180115),
 (67318, 4719, 'The Funky Grooves Tour', 20180115)]

In [162]:
%%sql 
SELECT * FROM facebook_event_checkin
WHERE event_name LIKE "%expensive%" or event_name LIKE "%Funky%" and date LIKE "2018%%%%" ;

 * sqlite:///data/sql-murder-mystery.db
Done.

[(72898, 8431, 'this garbage, having passed through a very expensive machine, is\n', 20171215),
 (26591, 8341, 'this garbage, having passed through a very expensive machine, is\n', 20180324),
 (61241, 232, 'this garbage, having passed through a very expensive machine, is\n', 20170329),
 (37533, 158, 'this garbage, having passed through a very expensive machine, is\n', 20180324),
 (96830, 3841, 'this garbage, having passed through a very expensive machine, is\n', 20171204),
 (25621, 1519, 'this garbage, having passed through a very expensive machine, is\n', 20180322),
 (29787, 8515, 'this garbage, having passed through a very expensive machine, is\n', 20180201),
 (64439, 493, 'this garbage, having passed through a very expensive machine, is\n', 20171107),
 (73198, 4464, 'this garbage, having passed through a very expensive machine, is\n', 20170524),
 (46239, 8082, 'this garbage, having passed through a very expensive machine, is\n', 20180219),
 (51320, 765, 'this garbage, having passed through a very expensive machine, is\n', 20170205),
 (39375, 1054, 'this garbage, having passed through a very expensive machine, is\n', 20170623),
 (87489, 541, 'this garbage, having passed through a very expensive machine, is\n', 20170102),
 (81476, 4961, 'this garbage, having passed through a very expensive machine, is\n', 20180304),
 (79264, 8976, 'this garbage, having passed through a very expensive machine, is\n', 20170806),
 (82760, 8040, 'this garbage, having passed through a very expensive machine, is\n', 20171125),
 (14887, 4719, 'The Funky Grooves Tour', 20180115),
 (16371, 4719, 'The Funky Grooves Tour', 20180115),
 (67318, 4719, 'The Funky Grooves Tour', 20180115)]